tsung_test_post_seed.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/home/ec2-user/opt/tsung-1.5.0/share/tsung/tsung-1.0.dtd">
<tsung loglevel="notice" version="1.0">

  <!-- Client side setup -->
  <clients>
    <client host="localhost" use_controller_vm="true" maxusers='15000'/>
  </clients>

  <!-- Server side setup -->
  <servers>
    <server host="" port="80" type="tcp"></server>
  </servers>

  <load>
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="1.5" unit="second"></users>
    </arrivalphase>
   <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
   <arrivalphase phase="4" duration="60" unit="second">
     <users arrivalrate="4" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="5" duration="60" unit="second">
     <users arrivalrate="6" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="6" duration="60" unit="second">
     <users arrivalrate="10" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="7" duration="60" unit="second">
     <users arrivalrate="16" unit="second"></users>
   </arrivalphase>
   <!--<arrivalphase phase="8" duration="60" unit="second">
     <users arrivalrate="20" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="9" duration="60" unit="second">
     <users arrivalrate="25" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="10" duration="60" unit="second">
     <users arrivalrate="35" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="11" duration="60" unit="second">
     <users arrivalrate="45" unit="second"></users>
   </arrivalphase>
   <arrivalphase phase="12" duration="60" unit="second">
     <users arrivalrate="55" unit="second"></users>
   </arrivalphase>-->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>

    <option type="ts_http" name="user_agent">
      <user_agent probability="100">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
    </option>
  </options>

  <sessions>
    <!-- Tutor -->
    <session name="new-tutor-session" probability="25" type="ts_http">

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <request>
        <http url='/signup' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="random_string" length="20">
        <var name="rndstring1" />
      </setdynvars>

      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="course_number" />
      </setdynvars>

      <!-- Sign up a new user -->
      <repeat name="signInLoop" max_repeat="5">
        <thinktime value="3" random="true"></thinktime>
        <request subst="true">
          <http url='/signup' version='1.1' method='POST'
          contents="user%5Bname%5D=%%_rndstring1%%&amp;user%5Bemail%5D=%%_rndstring1%%%40example.com&amp;user%5Bpassword%5D=foobar&amp;user%5Bpassword_confirmation%5D=foobar&amp;commit=Create+my+account"></http>
        </request>

        <request subst="true">
           <dyn_variable name="dashboard_string" re='&lt;(My Dashboard)&gt;' ></dyn_variable>
          <http url='/' version='1.1' method='GET'></http>
        </request>

        <until var="dashboard_string" neq='' />
      </repeat>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Edit Profile -->
      <request>
        <http url='/edit_profile' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Add Education-->
      <request subst="true">
        <http url='/add_education' version='1.1' method='POST'
          contents="education%5Bname%5D=university+of+california+los+angeles&amp;education%5Balias%5D=ucla&amp;commit=Add+education"></http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <request>
        <http url='/edit_profile' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <request>
        <http url='/edit_education?eid=1' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 2 seconds -->
      <thinktime value="2" random="true"></thinktime>

      <!-- Add course to education -->
      <request subst="true">
        <http url='/update_education' version='1.1' method='POST'
          contents="course_user%5Bcourse_name%5D=computer+science+%%_course_number%%&amp;course_user%5Bcourse_alias%5D=cs%%_course_number%%&amp;course%5Bdepartment%5D=computer+science&amp;commit=Add+Course"></http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <repeat name="checkRequests" max_repeat="10">
        <thinktime value="5" random="true"></thinktime>
        <request subst="true">
          <dyn_variable name="request_params" re='&lt;form class="button-to-form" method="post" action="(.*)"&gt;' ></dyn_variable>
          <http url='/requests' version='1.1' method='GET'></http>
        </request>
        <until var="request_params" neq='' />
      </repeat>

      <!-- Accept request  -->
      <if var="request_params" neq=''>
        <request subst="true">
          <http url='/%%_request_params%%' version='1.1' method='POST'></http>
        </request>

        <!--<request subst="true">
          <dyn_variable name="student_id" re='&lt;h2 class="message-other-user"&gt;\s*&lt;a href="/users/([0-9]*)"&gt;' ></dyn_variable>
          <http url='/messages' version='1.1' method='GET'></http>
        </request>-->


        <thinktime value="5" random="true"></thinktime>
        <request subst="true">
          <dyn_variable name="conversation_link" re='&lt;a href="(.*)"&gt;Conversation' ></dyn_variable>
          <http url='/' version='1.1' method='GET'></http>
        </request>

        <!-- Conversation with student -->
        <if var="conversation_link" neq=''>
          <for from="1" to="10" incr="1" var="counter">
            <request subst="true">
              <dyn_variable name="other_user_id" re='id="message-other-user-id" value="([0-9]*)"' ></dyn_variable>
              <dyn_variable name="last_message_time" re='id="message-last-time" value="([0-9]*)"' ></dyn_variable>
              <dyn_variable name="last_message_id" re='id="message-last-id" value="([0-9]*)"' ></dyn_variable>
              <http url='%%_conversation_link%%' version='1.1' method='GET'></http>
            </request>

            <setdynvars sourcetype="random_string" length="20">
              <var name="rndmessage" />
            </setdynvars>

            <request subst="true">
              <http url='/send_message' version='1.1' method='POST'
            contents="message=%%_rndmessage%%&amp;user=%%_other_user_id%%&amp;"></http>
            </request>

            <setdynvars sourcetype="random_number" start="1" end="5">
              <var name="poll_number" />
            </setdynvars>

            <for from="1" to="%%_poll_number%%" incr="1" var="counter2">
              <thinktime value="2" random="true"></thinktime>

              <request subst="true">
                <http url='/fetch_messages?other_user_id=%%_other_user_id%%&amp;last_message_time=%%_last_message_time%%&amp;last_message_id=%%last_message_id%%' version='1.1' method='GET'></http>
                </request>
            </for>

          </for>
        </if>
      </if>


      <!-- Use for debugging dynamic variables -->
      <!--
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
          io:format([126, $p, 126, $n, 126, $n], [DynVars]),
          ok end.">
          <var name="dump" />
      </setdynvars>
      -->

    </session>

    <session name="new-student-session" probability="25" type="ts_http">
      <thinktime value="5" random="true"></thinktime>

      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <request>
        <http url='/signup' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="random_string" length="20">
        <var name="rndstring1" />
      </setdynvars>

      <!-- Sign up a new user -->
      <repeat name="signInLoop" max_repeat="5">
        <thinktime value="3" random="true"></thinktime>
        <request subst="true">
          <http url='/signup' version='1.1' method='POST'
          contents="user%5Bname%5D=%%_rndstring1%%&amp;user%5Bemail%5D=%%_rndstring1%%%40example.com&amp;user%5Bpassword%5D=foobar&amp;user%5Bpassword_confirmation%5D=foobar&amp;commit=Create+my+account"></http>
        </request>

        <request subst="true">
           <dyn_variable name="dashboard_string" re='&lt;(My Dashboard)&gt;' ></dyn_variable>
          <http url='/' version='1.1' method='GET'></http>
        </request>

        <until var="dashboard_string" neq='' />
      </repeat>

      <request subst="true">
          <dyn_variable name="my_id" re='href="/users/([0-9]*)"&gt;Profile' ></dyn_variable>
          <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- wait for up to 5 seconds -->
      <thinktime value="5" random="true"></thinktime>

      <!-- Search for a tutor by course type-->
      <repeat name="find_courses" max_repeat="10">
        <setdynvars sourcetype="random_number" start="1" end="100">
          <var name="course_number" />
        </setdynvars>

        <request subst="true">
          <dyn_variable name="course_url" re='&lt;li&gt;\s*&lt;a href="(.*)">computer science' ></dyn_variable>
          <http url='/search?type=Course&amp;input=cs%%_course_number%%' version='1.1' method='GET'></http>
        </request>
        <until var="course_url" neq='' />
      </repeat>

      <thinktime value="2" random="true"></thinktime>

      <!-- take first user on the list-->
      <request subst="true">
        <dyn_variable name="user_id" re='&lt;a href="/users/([0-9]*)"&gt;' ></dyn_variable>
        <http url='%%_course_url%%' version='1.1' method='GET'></http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <!-- if we found an actual user -->
      <if var="user_id" neq=''>
        <request subst="true">
          <http url='/users/%%_user_id%%' version='1.1' method='GET'></http>
        </request>

        <request subst="true">
          <http url='/request_tutor?user=%%_user_id%%' version='1.1' method='POST'></http>
        </request>

        <thinktime value="3" random="true"></thinktime>

        <setdynvars sourcetype="random_string" length="20">
          <var name="rndmsg" />
        </setdynvars>

        <request subst="true">
          <http url='/send_user_request' version='1.1' method='POST'
            contents="message=%%_rndmsg%%&amp;tutor=%%_user_id%%&amp;student=%%_my_id%%&amp;type=tutor_request&amp;commit=Send+Request"></http>
        </request>

        <thinktime value="3" random="true"></thinktime>

        <repeat name="checkDash" max_repeat="10">
          <thinktime value="5" random="true"></thinktime>
          <request subst="true">
            <dyn_variable name="conversation_link" re='&lt;a href="(.*)"&gt;Conversation' ></dyn_variable>
            <http url='/' version='1.1' method='GET'></http>
          </request>
          <until var="conversation_link" neq='' />
        </repeat>


        <!-- if a tutor accepted your request -->
        <if var="conversation_link" neq=''>
          <!--<request subst="true">
            <dyn_variable name="student_id" re='&lt;h2 class="message-other-user"&gt;\s*&lt;a href="/users/([0-9]*)"&gt;' ></dyn_variable>
            <http url='%%_conversation_link%%' version='1.1' method='GET'></http>
          </request>-->

          <!-- Conversation with tutor -->
          <for from="1" to="10" incr="1" var="counter">
            <request subst="true">
              <dyn_variable name="other_user_id" re='id="message-other-user-id" value="([0-9]*)"' ></dyn_variable>
              <dyn_variable name="last_message_time" re='id="message-last-time" value="([0-9]*)"' ></dyn_variable>
              <dyn_variable name="last_message_id" re='id="message-last-id" value="([0-9]*)"' ></dyn_variable>
              <http url='%%_conversation_link%%' version='1.1' method='GET'></http>
            </request>

            <setdynvars sourcetype="random_string" length="20">
              <var name="rndmessage" />
            </setdynvars>

            <request subst="true">
              <http url='/send_message' version='1.1' method='POST'
            contents="message=%%_rndmessage%%&amp;user=%%_other_user_id%%&amp;"></http>
            </request>

              <setdynvars sourcetype="random_number" start="1" end="5">
                <var name="poll_number" />
              </setdynvars>

              <for from="1" to="%%_poll_number%%" incr="1" var="counter2">
                <thinktime value="2" random="true"></thinktime>

                <request subst="true">
                  <http url='/fetch_messages?other_user_id=%%_other_user_id%%&amp;last_message_time=%%_last_message_time%%&amp;last_message_id=%%last_message_id%%' version='1.1' method='GET'></http>
                </request>
              </for>

          </for>
        </if>
      </if>

      <!-- Use for debugging dynamic variables -->
      <!--
      <setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
          io:format([126, $p, 126, $n, 126, $n], [DynVars]),
          ok end.">
          <var name="dump" />
      </setdynvars>
      -->
    </session>

    <session name="returning-user" probability="50" type="ts_http">
      <request>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <setdynvars sourcetype="random_number" start="1" end="11">
        <var name="current_user_id" />
      </setdynvars>

      <request subst="true">
        <http url='/login' version='1.1' method='POST'
        contents="session%5Bemail%5D=user_%%_current_user_id%%%40example.com&amp;session%5Bpassword%5D=password&amp;session%5Bremember_me%5D=0%%&amp;commit=Log+in"></http>
      </request>

      <!-- Check requests randomly -->
      <repeat name="checkRequests" max_repeat="10">
        <thinktime value="5" random="true"></thinktime>
        <request subst="true">
          <dyn_variable name="request_params" re='&lt;form class="button-to-form" method="post" action="(.*)"&gt;' ></dyn_variable>
          <http url='/requests' version='1.1' method='GET'></http>
        </request>
        <until var="request_params" neq='' />
      </repeat>

      <!-- If we have a request accept it  -->
      <if var="request_params" neq=''>
        <request subst="true">
          <http url='/%%_request_params%%' version='1.1' method='POST'></http>
        </request>
      </if>

      <!-- Check dashboard for conversations -->
      <thinktime value="5" random="true"></thinktime>
      <request subst="true">
        <dyn_variable name="conversation_link" re='&lt;a href="(.*)"&gt;Conversation' ></dyn_variable>
        <http url='/' version='1.1' method='GET'></http>
      </request>

      <!-- Conversation -->
      <if var="conversation_link" neq=''>
        <for from="1" to="10" incr="1" var="counter">
          <request subst="true">
            <dyn_variable name="other_user_id" re='id="message-other-user-id" value="([0-9]*)"' ></dyn_variable>
            <dyn_variable name="last_message_time" re='id="message-last-time" value="([0-9]*)"' ></dyn_variable>
            <dyn_variable name="last_message_id" re='id="message-last-id" value="([0-9]*)"' ></dyn_variable>
            <http url='%%_conversation_link%%' version='1.1' method='GET'></http>
          </request>

          <setdynvars sourcetype="random_string" length="20">
            <var name="rndmessage" />
          </setdynvars>

          <request subst="true">
            <http url='/send_message' version='1.1' method='POST'
          contents="message=%%_rndmessage%%&amp;user=%%_other_user_id%%&amp;"></http>
          </request>

          <setdynvars sourcetype="random_number" start="1" end="5">
            <var name="poll_number" />
          </setdynvars>

          <for from="1" to="%%_poll_number%%" incr="1" var="counter2">
            <thinktime value="2" random="true"></thinktime>

            <request subst="true">
              <http url='/fetch_messages?other_user_id=%%_other_user_id%%&amp;last_message_time=%%_last_message_time%%&amp;last_message_id=%%last_message_id%%' version='1.1' method='GET'></http>
              </request>
          </for>

        </for>
      </if>

      <!--<setdynvars sourcetype="eval" code="fun( {Pid, DynVars} ) ->
          io:format([126, $p, 126, $n, 126, $n], [DynVars]),
          ok end.">
          <var name="dump" />
      </setdynvars>-->
    </session>

    <!--  This type of user just runs searches -->
    <session name="search-user" probability="0" type="ts_http">
    </session>
  </sessions>
</tsung>